Repository: MNwake/hydrodrag_frontend
Catalog: hydrodrags_app/lib/l10n/app_*.arb
Languages: es

# appTagline
source: Racer Registration & Event Management
es: Registro de Corredores y Gestión de Eventos

# continueButton
source: Continue
es: Continuar

source: Language
es: Idioma

source: Welcome
es: Bienvenido

source: Continue as
es: Continuar como

source: Racer
es: Corredor

source: Admin / Staff
es: Admin / Personal

source: Spectator
es: Espectador

source: Phone Number
es: Número de Teléfono

source: Email
es: Correo Electrónico

source: Send Code
es: Enviar Código

# sendCodeSubtitle
source: We'll send a verification code to your email
es: Enviaremos un código de verificación a su correo electrónico

# codeSent
source: Code sent! Check your email
es: ¡Código enviado! Revise su correo electrónico

# enterCode
source: Enter Verification Code
es: Ingresar Código de Verificación

# enterCodeSubtitle
source: Enter the 6-digit code sent to your email
es: Ingrese el código de 6 dígitos enviado a su correo electrónico

# codeRequired
source: Please enter the verification code
es: Por favor ingrese el código de verificación

# invalidCode
source: Invalid code. Please try again
es: Código inválido. Por favor intente de nuevo

source: Resend Code
es: Reenviar Código

# didntReceiveCode
source: Didn't receive a code?
es: ¿No recibiste el código?

# codeExpired
source: Code expired. Please request a new one
es: Código expirado. Por favor solicite uno nuevo

source: Verify
es: Verificar

source: Verifying...
es: Verificando...

source: Sending code...
es: Enviando código...

source: Racer Profile
es: Perfil del Corredor

# personalInfo
source: Personal Information
es: Información Personal

source: First Name
es: Nombre

source: Last Name
es: Apellido

source: Date of Birth
es: Fecha de Nacimiento

source: Gender
es: Género

source: Gender (Optional)
es: Género (Opcional)

source: Nationality
es: Nacionalidad

source: Nationality (Optional)
es: Nacionalidad (Opcional)

# contactInfo
source: Contact Information
es: Información de Contacto

source: Emergency Contact
es: Contacto de Emergencia

source: Emergency Contact Name
es: Nombre del Contacto de Emergencia

source: Emergency Contact Phone
es: Teléfono del Contacto de Emergencia

source: Address
es: Dirección

source: Street
es: Calle

source: City
es: Ciudad

source: State / Province
es: Estado / Provincia

source: Country
es: País

source: ZIP / Postal Code
es: Código Postal

source: Membership Details
es: Detalles de Membresía

source: IHRA Membership
es: Membresía IHRA

# organization
source: Organization / Association
es: Organización / Asociación

source: Membership Number
es: Número de Membresía

source: Membership Number (Optional)
es: Número de Membresía (Opcional)

# ihraMembershipNumberOptional
source: IHRA Membership # (Optional)
es: Número de Membresía IHRA # (Opcional)

source: IHRA Membership Purchased At (Optional)
es: Fecha de compra de membresía IHRA (Opcional)

source: Class / Category
es: Clase / Categoría

source: Next
es: Siguiente

source: Previous
es: Anterior

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Edit
es: Editar

source: Edit Name
es: Editar Nombre

source: Edit Phone
es: Editar Teléfono

source: Profile image updated
es: Imagen de perfil actualizada

source: Profile updated
es: Perfil actualizado

source: Bio
es: Biografía

# bioHint
source: Tell us about yourself...
es: Cuéntanos sobre ti...

source: Edit Bio
es: Editar Biografía

source: Sponsors
es: Patrocinadores

# sponsorsHint
source: List your sponsors (one per line)
es: Lista tus patrocinadores (uno por línea)

source: Edit Sponsors
es: Editar Patrocinadores

source: Edit Banner
es: Editar Banner

source: Remove Banner
es: Eliminar Banner

source: Banner image updated
es: Imagen de banner actualizada

source: Events
es: Eventos

source: Active Events
es: Eventos Activos

source: Event Name
es: Nombre del Evento

source: Location
es: Ubicación

source: Date
es: Fecha

source: Registration Status
es: Estado de Registro

source: Open
es: Abierto

source: Closed
es: Cerrado

source: Register
es: Registrarse

source: View Details
es: Ver Detalles

source: Register for Event
es: Registrarse para el Evento

source: Event Registration
es: Registro de Evento

# vehicleCraftInfo
source: Vehicle / Craft Information
es: Información del Vehículo / Embarcación

source: Craft Type
es: Tipo de Embarcación

source: Make
es: Marca

source: Model
es: Modelo

source: Engine Class
es: Clase de Motor

source: Modifications
es: Modificaciones

source: Class Selection
es: Selección de Clase

source: Race Options
es: Opciones de Carrera

source: Number of Entries
es: Número de Entradas

source: Heat Preferences
es: Preferencias de Serie

source: Transponder ID
es: ID del Transpondedor

source: Review & Confirm
es: Revisar y Confirmar

source: Summary
es: Resumen

# waiver
source: Liability Waiver
es: Renuncia de Responsabilidad

# waiverExplanation
source: This waiver must be reviewed and accepted before participation.
es: Esta renuncia debe ser revisada y aceptada antes de participar.

source: View Waiver
es: Ver Renuncia

source: Download PDF
es: Descargar PDF

source: I Understand
es: Entiendo

source: Waiver Signature
es: Firma de Renuncia

source: Full Legal Name
es: Nombre Legal Completo

# certifyAgree
source: I certify that I have read and agree to the terms and conditions of this waiver.
es: Certifico que he leído y acepto los términos y condiciones de esta renuncia.

source: Signature
es: Firma

source: Submit
es: Enviar

source: Registration Complete
es: Registro Completo

source: Success
es: Éxito

source: Registration ID
es: ID de Registro

source: Waiver Status
es: Estado de Renuncia

source: Signed
es: Firmado

source: View Registration
es: Ver Registro

source: Download Waiver PDF
es: Descargar PDF de Renuncia

# returnToDashboard
source: Return to Event Dashboard
es: Volver al Panel de Eventos

# racerDashboard
source: My Event Dashboard
es: Mi Panel de Eventos

source: Back to Events
es: Volver a Eventos

source: Class & Vehicle Summary
es: Resumen de Clase y Vehículo

source: Heat Assignments
es: Asignaciones de Serie

source: Bracket Position
es: Posición en el Bracket

source: Required
es: Requerido

source: Optional
es: Opcional

# scrollToEnd
source: Please scroll to the end of the waiver to continue
es: Por favor desplácese hasta el final de la renuncia para continuar

# signIn
source: Racer Sign In
es: Iniciar Sesión de Corredor

# signInSubtitle
source: Enter your email to receive a verification code
es: Ingrese su correo electrónico para recibir un código de verificación

# emailHint
source: Enter your email address
es: Ingrese su dirección de correo electrónico

# emailRequired
source: Please enter your email address
es: Por favor ingrese su dirección de correo electrónico

# invalidEmail
source: Please enter a valid email address
es: Por favor ingrese un correo electrónico válido

source: OR
es: O

source: Continue as Spectator
es: Continuar como Espectador

# viewEventsWithoutAccount
source: View events without an account
es: Ver eventos sin una cuenta

source: Create Account
es: Crear Cuenta

source: Sign Up
es: Registrarse

# signUpSubtitle
source: Create your racer account
es: Crea tu cuenta de corredor

source: Confirm Password
es: Confirmar Contraseña

# confirmPasswordHint
source: Re-enter your password
es: Vuelva a ingresar su contraseña

# confirmPasswordRequired
source: Please confirm your password
es: Por favor confirme su contraseña

source: Passwords do not match
es: Las contraseñas no coinciden

# alreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes una cuenta?

# dontHaveAccount
source: Don't have an account?
es: ¿No tienes una cuenta?

source: Sign in here
es: Inicia sesión aquí

# createAccountButton
source: Create Account
es: Crear Cuenta

source: HydroDrags Info
es: Información de HydroDrags

source: It's Time To Send It
es: Es Hora de Enviarlo

source: About HydroDrags
es: Acerca de HydroDrags

# aboutParagraph1
source: The event features the World's fastest PWC Drag Racers, that come from all over the USA and beyond! This event has produced World Speed Records in every Class, With Speeds of 143mph in the Unlimited Class. The Stock and Spec Classes and our newest class Turbo No Nitrous are featured on Saturday, and the Superstock and Unlimited Classes and Speed Ally are featured on Sunday.
es: ¡El evento presenta a los corredores de PWC Drag más rápidos del mundo, que vienen de todo Estados Unidos y más allá! Este evento ha producido récords mundiales de velocidad en cada clase, con velocidades de 143 mph en la Clase Ilimitada. Las Clases Stock y Spec y nuestra nueva clase Turbo Sin Nitro se presentan el sábado, y las Clases Superstock e Ilimitadas y Speed Alley se presentan el domingo.

# aboutParagraph2
source: This is a fun event, filled with excitement and the adrenalin filled atmosphere providing some exciting racing, that also serves as an economic impact, with most of the competitors and their families, sponsors, and support crews coming from out of the area.
es: Este es un evento divertido, lleno de emoción y una atmósfera llena de adrenalina que proporciona carreras emocionantes, que también sirve como un impacto económico, con la mayoría de los competidores y sus familias, patrocinadores y equipos de apoyo viniendo de fuera del área.

source: World Record Speed
es: Velocidad de Récord Mundial

# worldRecordDescription
source: The FASTEST ski on the water is held by Team CRT With The Worlds Fastest Unlimited Ski of 143mph!
es: ¡El esquí MÁS RÁPIDO en el agua lo tiene el Equipo CRT con el Esquí Ilimitado Más Rápido del Mundo de 143 mph!

source: Age Requirement
es: Requisito de Edad

# ageRequirementDescription
source: We love seeing young riders get interested in the event but the earliest you can compete with the big boys is 15 years old.
es: Nos encanta ver a los jóvenes corredores interesarse en el evento, pero la edad más temprana para competir con los grandes es de 15 años.

source: ISJBA Membership Required
es: Membresía ISJBA Requerida

# isjbaMembershipDescription
source: All competitors must have a valid ISJBA membership at the time of the event.
es: Todos los competidores deben tener una membresía ISJBA válida al momento del evento.

source: Location & Venue
es: Ubicación y Lugar

# venueName
source: Burt Aaronson South County Regional Park
es: Parque Regional del Condado Sur Burt Aaronson

# venueSubtitle
source: Sunset Cove Amphitheater
es: Anfiteatro Sunset Cove

# venueDetailNoBleachers
source: No bleacher seating - bring your own chairs and tents
es: No hay gradas - traiga sus propias sillas y carpas

# venueDetailEarlyArrival
source: Early arrival recommended to secure your spot
es: Se recomienda llegar temprano para asegurar su lugar

# venueDetailNoGlass
source: No glass bottles allowed
es: No se permiten botellas de vidrio

# venueDetailFreeParking
source: Free spectator parking
es: Estacionamiento gratuito para espectadores

source: Rules & Regulations
es: Reglas y Regulaciones

# rulesIntro
source: We want to see new world records, but it is our priority to make sure everyone stays safe on a level playing field.
es: Queremos ver nuevos récords mundiales, pero nuestra prioridad es asegurarnos de que todos permanezcan seguros en un campo de juego nivelado.

source: Key Rules
es: Reglas Clave

# keyRulesDescription
source: • NO SWITCHING OF PWC PERIOD! YOU RACE WHAT YOU REGISTER WITH. • Top 4 Skis Must Report within 5 Min To Tech Tent Following Their Race • 2 MIN COUNTDOWN From When Racer's name is Called over PA To Launchpad • Any Unsportsmanlike Conduct Will not be Tolerated • Anytime On the Water: Helmets and Life Jackets Required
es: • ¡NO SE PERMITE CAMBIAR DE PWC! CORRES CON LO QUE REGISTRASTE. • Los 4 Esquís Principales Deben Reportarse Dentro de 5 Minutos a la Tienda de Tecnología Después de Su Carrera • CUENTA REGRESIVA DE 2 MINUTOS Desde Que el Nombre del Corredor es Llamado por el Altavoz Hasta la Plataforma de Lanzamiento • No se Tolerará Cualquier Conducta Antideportiva • En Cualquier Momento En el Agua: Cascos y Chalecos Salvavidas Requeridos

# viewFullRules
source: View Full Rules & Regulations
es: Ver Reglas y Regulaciones Completas

source: Our Sponsors
es: Nuestros Patrocinadores

# sponsorsIntro
source: The HydroDrags US Nationals World Championship could not be possible without these sponsors.
es: El Campeonato Mundial de US Nationals de HydroDrags no sería posible sin estos patrocinadores.

source: Media Partners
es: Socios de Medios

# mediaPartnersIntro
source: Catch all the action through our media partners!
es: ¡Atrapa toda la acción a través de nuestros socios de medios!

# mediaRacerH2ODescription
source: Live streaming coverage bringing you watercraft racing coverage like no one else.
es: Cobertura de transmisión en vivo que te brinda cobertura de carreras de embarcaciones como nadie más.

# mediaFloridaSkiRidersDescription
source: Creating videos and capturing images and memories of the event.
es: Creando videos y capturando imágenes y recuerdos del evento.

# mediaMVPProductionsDescription
source: Professional photography capturing life's best moments.
es: Fotografía profesional capturando los mejores momentos de la vida.

# mediaProRiderMagazineDescription
source: Written articles and amazing images in the magazine that started it all.
es: Artículos escritos e imágenes increíbles en la revista que lo inició todo.

source: Contact Us
es: Contáctanos

# contactPhone
source: Phone
es: Teléfono

# contactEmail
source: Email
es: Correo Electrónico

source: Choose from Gallery
es: Elegir de la Galería

source: Take a Photo
es: Tomar una Foto

source: Remove Photo
es: Eliminar Foto

source: Change Photo
es: Cambiar Foto

source: Add Photo
es: Agregar Foto

source: Select date
es: Seleccionar fecha

source: Male
es: Masculino

source: Female
es: Femenino

source: Complete
es: Completar

# errorPickingImage
source: Error picking image: {error}
es: Error al seleccionar imagen: {error}

# errorSubmittingProfile
source: Error submitting profile: {error}
es: Error al enviar perfil: {error}

source: Submitting profile...
es: Enviando perfil...

# streetHint
source: Enter your street address
es: Ingrese su dirección

# zipHint
source: Enter zip code first for better results
es: Ingrese el código postal primero para mejores resultados

source: PWC Management
es: Gestión de PWC

source: Add PWC
es: Agregar PWC

source: PWC Name
es: Nombre del PWC

# pwcNameHint
source: Enter a name for your PWC
es: Ingrese un nombre para su PWC

source: Edit PWC
es: Editar PWC

# noPWCs
source: No PWCs have been registered yet
es: No hay PWC registrados aún

# addPWCToGetStarted
source: Add your first personal watercraft to get started
es: Agregue su primera embarcación personal para comenzar

source: Primary
es: Principal

source: Set as Primary
es: Establecer como Principal

source: Delete PWC
es: Eliminar PWC

# deletePWCConfirmation
source: Are you sure you want to delete this PWC? This action cannot be undone.
es: ¿Está seguro de que desea eliminar este PWC? Esta acción no se puede deshacer.

source: Delete
es: Eliminar

# pwcDeleted
source: PWC deleted successfully
es: PWC eliminado exitosamente

source: Error deleting PWC
es: Error al eliminar PWC

source: Error saving PWC
es: Error al guardar PWC

source: Retry
es: Reintentar

# serverUnavailableTitle
source: Server Unavailable
es: Servidor no disponible

# serverUnavailableMessage
source: Unable to connect to the server. Please check your connection and try again.
es: No se puede conectar al servidor. Por favor verifique su conexión e intente de nuevo.

source: Retry Connection
es: Reintentar conexión

source: Continue Offline
es: Continuar sin conexión

source: Select Make
es: Seleccionar Marca

source: Enter Make
es: Ingresar Marca

# makeRequired
source: Make is required
es: La marca es requerida

source: Enter Model
es: Ingresar Modelo

# modelRequired
source: Model is required
es: El modelo es requerido

source: Year
es: Año

source: Enter Year
es: Ingresar Año

# invalidYear
source: Please enter a valid year
es: Por favor ingrese un año válido

source: Select Engine Class
es: Seleccionar Clase de Motor

source: Engine Size
es: Tamaño del Motor

# enterEngineSize
source: Enter Engine Size (e.g., 1100cc)
es: Ingresar Tamaño del Motor (ej., 1100cc)

source: Enter Color
es: Ingresar Color

source: Registration Number
es: Número de Registro

source: Enter Registration Number
es: Ingresar Número de Registro

source: Serial Number
es: Número de Serie

source: Enter Serial Number
es: Ingresar Número de Serie

source: Notes
es: Notas

# additionalNotes
source: Additional notes or custom modifications
es: Notas adicionales o modificaciones personalizadas

source: Set as Primary PWC
es: Establecer como PWC Principal

# primaryPWCDescription
source: This will be your default PWC for race registrations
es: Este será su PWC predeterminado para registros de carreras

# andMore
source: {count} more
es: {count} más

source: Registered Racers
es: Corredores Registrados

# noRacersRegistered
source: No racers registered yet.
es: Aún no hay corredores registrados.

# selectClassAndPWC
source: Select Class & PWC
es: Seleccionar Clase y PWC

# selectClassAndPWCDescription
source: Choose your racing class and the PWC you'll be racing with.
es: Elija su clase de carrera y el PWC con el que competirá.

# selectPWC
source: Select Personal Watercraft
es: Seleccionar Embarcación Personal

# pwcRequired
source: Please select a PWC
es: Por favor seleccione un PWC

source: No PWCs Found
es: No se Encontraron PWC

# addPWCFirst
source: You need to add a PWC to your account before registering for an event.
es: Necesita agregar un PWC a su cuenta antes de registrarse para un evento.

source: Class / Division
es: Clase / División

source: Select Class / Division
es: Seleccionar Clase / División

# classDivisionHelper
source: Choose the racing class you'll compete in
es: Elija la clase de carrera en la que competirá

# classDivisionRequired
source: Class/Division is required
es: La clase/división es requerida

source: Selected PWC
es: PWC Seleccionado

# transponderIdHint
source: Enter your transponder ID (optional)
es: Ingrese su ID de transpondedor (opcional)

source: Proceeding to waiver...
es: Procediendo a la renuncia...

# paymentStep
source: Payment
es: Pago

# paymentStepDescription
source: Payment integration will be available soon.
es: La integración de pago estará disponible pronto.

source: Continue to Waiver
es: Continuar a la Renuncia

source: Complete Payment
es: Completar Pago

# paymentNotYetImplemented
source: Payment integration coming soon
es: Integración de pago próximamente

# unknownError
source: An unknown error occurred
es: Ocurrió un error desconocido

# networkError
source: Network connection error. Please check your internet connection.
es: Error de conexión de red. Por favor verifique su conexión a internet.

# timeoutError
source: Request timed out. Please try again.
es: La solicitud expiró. Por favor intente de nuevo.

# serverError
source: Server error. Please try again later.
es: Error del servidor. Por favor intente más tarde.

# unauthorizedError
source: Authentication failed. Please log in again.
es: Error de autenticación. Por favor inicie sesión nuevamente.

# notFoundError
source: Resource not found.
es: Recurso no encontrado.

# validationError
source: Invalid data provided. Please check your input.
es: Datos inválidos proporcionados. Por favor verifique su entrada.

# rateLimitError
source: Too many requests. Please wait a moment and try again.
es: Demasiadas solicitudes. Por favor espere un momento e intente de nuevo.

source: OK
es: Aceptar

source: Sign Out
es: Cerrar Sesión

# signOutConfirmation
source: Are you sure you want to sign out?
es: ¿Está seguro de que desea cerrar sesión?

source: Important Information
es: Información Importante

# readWaiverCarefully
source: Read the full waiver carefully before signing
es: Lea la renuncia completa cuidadosamente antes de firmar

# languageToggleHint
source: You can change the language using the toggle in the app bar
es: Puede cambiar el idioma usando el interruptor en la barra de la aplicación

# downloadPdfComingSoon
source: PDF download coming soon
es: Descarga de PDF próximamente

# viewRegistrationComingSoon
source: Registration details coming soon
es: Detalles de registro próximamente

# addClassEntry
source: Add another class
es: Agregar otra clase

# removeClassEntry
source: Remove
es: Quitar

source: Purchase IHRA membership with registration
es: Comprar membresía IHRA con el registro

# validIhraMembershipDescription
source: Valid IHRA membership requires a membership number and purchase within this calendar year. Add membership purchase to your registration if needed.
es: La membresía IHRA válida requiere número de membresía y compra dentro del año en curso. Agregue la compra de membresía a su registro si es necesario.

# spectatorDayPasses
source: Additional day passes (spectator tickets)
es: Pases de día adicionales (entradas de espectador)

# spectatorDayPassesDescription
source: Purchase additional day passes for spectators before checkout.
es: Compre pases de día adicionales para espectadores antes de pagar.

# dayPassesQuantity
source: Number of day passes
es: Cantidad de pases de día

# spectatorSingleDayPass
source: Single day pass ($30)
es: Pase de un día ($30)

# spectatorWeekendPass
source: Weekend pass ($40)
es: Pase de fin de semana ($40)

# classesAndPwc
source: Classes & PWC
es: Clases y PWC

source: Checkout
es: Pago

source: Order Summary
es: Resumen del Pedido

source: Pay with PayPal
es: Pagar con PayPal

# afterPayPalReturn
source: After completing payment in the browser, return to this app and tap below.
es: Después de completar el pago en el navegador, vuelva a esta aplicación y toque abajo.

source: I've completed payment
es: He completado el pago
